Revit 2027 API
TextNode.Text Property
 The content of the text annotation as a plain string stripped of all formatting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Text { get; }
Public ReadOnly Property Text As String
	Get
public:
property String^ Text {
	String^ get ();
}
member Text : string with get
Property Value
String
Remarks
 The text may contain new-lines if there are any in the text annotation.
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace